#0.051638

library(data.table)

測試會員表 = fread("sample_submission.csv", col.names=c("會員標識", "拍賣標識"))
測試會員表 = unique(測試會員表[, .(會員標識)], by = NULL)

拍賣表 = fread("auction.csv", col.names=c("拍賣標識", "商品種別標識", "商品標識", "再出品回數", "狀態標識", "品牌標識", "類型標識", "類型組標識", "線標識", "顏色", "男女別標識", "參考價格", "拍賣作成日"))
拍賣表$拍賣作成日序 = as.double(as.Date(substring(拍賣表$拍賣作成日, 1, 10))-as.Date("2019-10-01"))

氣入追加表 = fread("watchlist.csv", col.names=c("會員標識", "拍賣標識", "登錄日", "削除標記"))
氣入追加表$登錄日序 = as.double(as.Date(substring(氣入追加表$登錄日, 1, 10))-as.Date("2019-10-01"))
氣入追加表 = merge(氣入追加表, 拍賣表, by = "拍賣標識")

入札表 = fread("shudounyuusatsu.csv", col.names=c("拍賣標識", "會員標識", "入札日", "金額", "數量", "即決標記", "削除標記"))
入札表$入札日序 = as.double(as.Date(substring(入札表$入札日, 1, 10))-as.Date("2019-10-01"))
入札表 = merge(入札表, 拍賣表, by = "拍賣標識")

測試日序 = -7

預測表 = rbind(
	入札表[, .(會員標識, 拍賣標識, 打分 = 1 / (測試日序 - 拍賣作成日序) ** 0.5 / (測試日序 - 入札日序))]
	, 氣入追加表[削除標記 == 1, .(會員標識, 拍賣標識, 打分 = 4 / (測試日序 - 拍賣作成日序) ** 0.5 / (測試日序 - 登錄日序))]
)
預測表 = merge(預測表, 測試會員表, by = "會員標識", all.y = T)
預測表 = 預測表[, .(打分 = max(打分)), .(會員標識, 拍賣標識)]
預測表 = 預測表[order(-打分)]

額外表 = 拍賣表[拍賣作成日序 == 測試日序 - 5, .(拍賣標識 =  sample(拍賣標識, 20))]
預測表 = 預測表[, .(預測序 = 1:20, 拍賣標識 = c(拍賣標識[!is.na(拍賣標識)], 額外表$拍賣標識)[1:20]), .(會員標識)]

write.csv(預測表[, .(KaiinID = 會員標識, AuctionID = 拍賣標識)], "result.csv", row.names = F, quote = F)
