library(data.table)

測試會員表 = fread("sample_submission.csv", col.names=c("會員標識", "拍賣標識"))
測試會員表 = unique(測試會員表[, .(會員標識)], by = NULL)

拍賣表 = fread("auction.csv", col.names=c("拍賣標識", "商品種別標識", "商品標識", "再出品回數", "狀態標識", "品牌標識", "類型標識", "類型組標識", "線標識", "顏色", "男女別標識", "參考價格", "拍賣作成日"))
拍賣表$拍賣作成日序 = as.double(as.Date(substring(拍賣表$拍賣作成日, 1, 10))-as.Date("2019-10-01"))

氣入追加表 = fread("watchlist.csv", col.names=c("會員標識", "拍賣標識", "登錄日", "削除標記"))
氣入追加表$登錄日序 = as.double(as.Date(substring(氣入追加表$登錄日, 1, 10))-as.Date("2019-10-01"))
氣入追加表 = merge(氣入追加表, 拍賣表, by = "拍賣標識")

入札表 = fread("shudounyuusatsu.csv", col.names=c("拍賣標識", "會員標識", "入札日", "金額", "數量", "即決標記", "削除標記"))
入札表$入札日序 = as.double(as.Date(substring(入札表$入札日, 1, 10))-as.Date("2019-10-01"))
入札表 = merge(入札表, 拍賣表, by = "拍賣標識")

線下參照表 = rbind(氣入追加表[登錄日序 >= -14 & 登錄日序 < -7, .(會員標識, 拍賣標識, 標籤 = 1)], 入札表[入札日序 >= -14 & 入札日序 < -7, .(會員標識, 拍賣標識, 標籤 = 2)])
線下參照表 = 線下參照表[, .(標籤 = max(標籤)), .(會員標識, 拍賣標識)]
線下測試會員表 = unique(線下參照表[, .(會員標識)], by = NULL)

線下氣入追加表 = 氣入追加表[登錄日序 < -14]
線下入札表 = 入札表[入札日序 < -14]

線下測試日序 = -14

線下預測表 = rbind(
	線下入札表[, .(會員標識, 拍賣標識, 打分 = 1 / (線下測試日序 - 拍賣作成日序) ** 0.2 / (線下測試日序 - 入札日序))]
	, 線下氣入追加表[削除標記 == 1, .(會員標識, 拍賣標識, 打分 = 4 / (線下測試日序 - 拍賣作成日序) ** 0.5 / (線下測試日序 - 登錄日序))]
)
線下預測表 = merge(線下預測表, 線下測試會員表, by = "會員標識", all.y = T)
線下預測表 = 線下預測表[, .(打分 = max(打分)), .(會員標識, 拍賣標識)]
線下預測表 = 線下預測表[order(-打分)]

線下額外表 = 拍賣表[拍賣作成日序 == 線下測試日序 - 5, .(拍賣標識 =  sample(拍賣標識, 20))]
線下預測表 = 線下預測表[, .(預測序 = 1:20, 拍賣標識 = c(拍賣標識[!is.na(拍賣標識)], 線下額外表$拍賣標識)[1:20]), .(會員標識)]




線下絕對預測表 = 線下參照表[, .(預測序 = 1:.N, 拍賣標識), .(會員標識)]
線下絕對評價表 = merge(線下絕對預測表, 線下參照表, by = c("會員標識", "拍賣標識"))
線下絕對評價表[, 評價 := (2 ** 標籤 - 1) / log(預測序 + 1) * log(2)]
線下絕對評價表 = 線下絕對評價表[, .(絕對評價 = sum(評價)), .(會員標識)]

線下評價表 = merge(線下預測表, 線下參照表, by = c("會員標識", "拍賣標識"))
線下評價表[, 評價 := (2 ** 標籤 - 1) / log(預測序 + 1) * log(2)]
線下評價表 = 線下評價表[, .(評價 = sum(評價)), .(會員標識)]
線下評價表 = merge(線下評價表, 線下絕對評價表, by = "會員標識", all.y = T)
線下評價表[is.na(線下評價表)] = 0

print(mean(線下評價表$評價 / 線下評價表$絕對評價))
#0.04643125
