library(data.table)
library(lightgbm)

Sys.setlocale("LC_CTYPE", "chinese")

測試會員表 = fread("sample_submission.csv", col.names=c("會員標識", "拍賣標識"))
測試會員表 = unique(測試會員表[, .(會員標識)], by = NULL)

拍賣表 = fread("auction.csv", col.names=c("拍賣標識", "商品種別標識", "商品標識", "再出品回數", "狀態標識", "品牌標識", "類型標識", "類型組標識", "線標識", "顏色", "男女別標識", "參考價格", "拍賣作成日"))
拍賣表$拍賣作成日序 = as.double(as.Date(substring(拍賣表$拍賣作成日, 1, 10))-as.Date("2019-10-01"))

氣入追加表 = fread("watchlist.csv", col.names=c("會員標識", "拍賣標識", "氣入追加日", "削除標記"))
氣入追加表$氣入追加日序 = as.double(as.Date(substring(氣入追加表$氣入追加日, 1, 10))-as.Date("2019-10-01"))
氣入追加表 = merge(氣入追加表, 拍賣表, by = "拍賣標識")

入札表 = fread("shudounyuusatsu.csv", col.names=c("拍賣標識", "會員標識", "入札日", "金額", "數量", "即決標記", "削除標記"))
入札表$入札日序 = as.double(as.Date(substring(入札表$入札日, 1, 10))-as.Date("2019-10-01"))
入札表 = merge(入札表, 拍賣表, by = "拍賣標識")


線下參照表 = rbind(氣入追加表[氣入追加日序 >= -14 & 氣入追加日序 < -7, .(會員標識, 拍賣標識, 標籤 = 1)], 入札表[入札日序 >= -14 & 入札日序 < -7, .(會員標識, 拍賣標識, 標籤 = 2)])
線下參照表 = 線下參照表[, .(標籤 = max(標籤)), .(會員標識, 拍賣標識)]
線下測試會員表 = unique(線下參照表[, .(會員標識)], by = NULL)

線下氣入追加表 = 氣入追加表[氣入追加日序 < -14]
線下入札表 = 入札表[入札日序 < -14]
線下落札表 = 落札表[拍賣作成日序 < -15]

線下測試日序 = -14

線下訓練參照表 = rbind(
	線下氣入追加表[氣入追加日序 >= 線下測試日序 - 7 & 氣入追加日序 < 線下測試日序, .(會員標識, 拍賣標識, 標籤 = 1)]
	, 線下入札表[入札日序 >= 線下測試日序 - 7 & 入札日序 < 線下測試日序, .(會員標識, 拍賣標識, 標籤 = 2)]
)
線下訓練參照表 = 線下訓練參照表[, .(標籤 = max(標籤)), .(會員標識, 拍賣標識)]
線下訓練會員表 = unique(線下訓練參照表[, .(會員標識)], by = NULL)

線下訓練氣入追加表 = 線下氣入追加表[氣入追加日序 < 線下測試日序 - 7]
線下訓練入札表 = 線下入札表[入札日序 < 線下測試日序 - 7]

取得資料 = function(某會員表, 某氣入追加表, 某入札表, 某日序)
{
	候選表 = unique(rbind(
		某氣入追加表[, .(會員標識, 拍賣標識)]
		, 某入札表[, .(會員標識, 拍賣標識)]
	), by = NULL)

	候選表 = merge(某會員表, 候選表, by = "會員標識")

	候選表 = merge(候選表, 某氣入追加表[, .(
		氣入追加數 = .N
		, 氣入追加之最小日序 = 某日序 - min(氣入追加日序)
		, 氣入追加之最大日序 = 某日序 - max(氣入追加日序)
		, 氣入追加之日序極差 = max(氣入追加日序) - min(氣入追加日序)
		, 氣入追加之削除標記 = 削除標記[氣入追加日序 == max(氣入追加日序)]
	), .(會員標識, 拍賣標識)], by = c("會員標識", "拍賣標識"), all.x = T)

	候選表 = merge(候選表, 某入札表[, .(
		入札數 = .N
		, 入札之最小日序 = 某日序 - min(入札日序)
		, 入札之最大日序 = 某日序 - max(入札日序)
		, 入札之日序極差 = max(入札日序) - min(入札日序)
		#, 入札之最大即決標記 = max(即決標記)
	), .(會員標識, 拍賣標識)], by = c("會員標識", "拍賣標識"), all.x = T)

	候選表[is.na(候選表)] = 0

	候選表
}

線下訓練資料表 = 取得資料(線下訓練會員表, 線下訓練氣入追加表, 線下訓練入札表, 線下測試日序 - 7)
線下訓練資料表 = merge(線下訓練資料表, 線下氣入追加表[氣入追加日序 >= 線下測試日序 - 7 & 氣入追加日序 < 線下測試日序, .(氣入追加標籤 = 1), .(會員標識, 拍賣標識)], all.x = T)
線下訓練資料表 = merge(線下訓練資料表, 線下入札表[入札日序 >= 線下測試日序 - 7 & 入札日序 < 線下測試日序, .(入札標籤 = 1), .(會員標識, 拍賣標識)], all.x = T)
線下訓練資料表[is.na(線下訓練資料表)] = 0
線下訓練資料表 = cbind(線下訓練資料表[, .(會員標識, 拍賣標識, 氣入追加標籤, 入札標籤)], 線下訓練資料表[, -c("會員標識", "拍賣標識", "氣入追加標籤", "入札標籤")])

線下氣入追加模型 = lgb.train(data = lgb.Dataset(data.matrix(線下訓練資料表[, c(-1:-4)]), label = 線下訓練資料表$氣入追加標籤), objective = "binary", nround = 500, learning_rate = 0.01, max_depth = 6, num_leaves = 127, verbosity = -1)
線下入札模型 = lgb.train(data = lgb.Dataset(data.matrix(線下訓練資料表[, c(-1:-4)]), label = 線下訓練資料表$入札標籤), objective = "binary", nround = 500, learning_rate = 0.01, max_depth = 6, num_leaves = 127, verbosity = -1)

線下測試資料表 = 取得資料(線下測試會員表, 線下氣入追加表, 線下入札表, 線下測試日序)
線下測試資料表 = cbind(線下測試資料表[, .(會員標識, 拍賣標識, 氣入追加標籤 = -1, 入札標籤 = -1)], 線下測試資料表[, -c("會員標識", "拍賣標識")])
線下預測表 = 線下測試資料表[, .(會員標識, 拍賣標識, 氣入追加打分 = predict(線下氣入追加模型, data.matrix(線下測試資料表[, c(-1:-4)])), 入札打分 = predict(線下入札模型, data.matrix(線下測試資料表[, c(-1:-4)])))]
線下預測表 = 線下預測表[, .(會員標識, 拍賣標識, 打分 = 0.2 * 氣入追加打分 + 0.8 * 入札打分)]
線下預測表 = 線下預測表[, .(打分 = max(打分)), .(會員標識, 拍賣標識)]
線下預測表 = 線下預測表[order(-打分)]
線下預測表 = merge(線下預測表, 線下測試會員表, by = "會員標識", all.y = T)

線下補充表 = 拍賣表[拍賣作成日序 == 線下測試日序 - 5, .(拍賣標識 =  sample(拍賣標識, 20))]
線下預測表 = 線下預測表[, .(預測序 = 1:20, 拍賣標識 = c(拍賣標識[!is.na(拍賣標識)], 線下補充表$拍賣標識)[1:20]), .(會員標識)]





線下絕對預測表 = 線下參照表[, .(預測序 = 1:.N, 拍賣標識), .(會員標識)]
線下絕對評價表 = merge(線下絕對預測表, 線下參照表, by = c("會員標識", "拍賣標識"))
線下絕對評價表[, 評價 := (2 ** 標籤 - 1) / log(預測序 + 1) * log(2)]
線下絕對評價表 = 線下絕對評價表[, .(絕對評價 = sum(評價)), .(會員標識)]

線下評價表 = merge(線下預測表, 線下參照表, by = c("會員標識", "拍賣標識"))
線下評價表[, 評價 := (2 ** 標籤 - 1) / log(預測序 + 1) * log(2)]
線下評價表 = 線下評價表[, .(評價 = sum(評價)), .(會員標識)]
線下評價表 = merge(線下評價表, 線下絕對評價表, by = "會員標識", all.y = T)
線下評價表[is.na(線下評價表)] = 0

print(mean(線下評價表$評價 / 線下評價表$絕對評價))
#0.05047791

